/*************************************************************************
	> File Name: value.c
	> Author: Tanxiaoze
	> Mail: 2406577693@qq.com
	> Created Time: 2018年10月11日 星期四 23时16分53秒
 ************************************************************************/

#include <stdio.h>

int main() {
    int x;
    float y;
    scanf("%d", &x);
    if (x >= 100 && x < 200) {
        y = x * 800 * 0.9;
    }
    if (x >= 200 && x < 300) {
        y = x * 800 * 0.85;
    }
    if (x >= 300 && x < 500) {
        y  = x * 800 * 0.82;
    }
    if (x >= 500) {
        y = x * 800 * 0.81;
    }
    printf("%d\n", (int)y);
    return 0;
}
